src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ЧекЛистПроверкиКачестваПряжи</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваТестовыхОтвязовПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ЧекЛистПроверкиКачестваПряжи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершенияПретензионнойРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразецОтвязаПереданКонфекционеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДляТестовогоОтвяза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениВязания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениПошива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыРасходаПряжи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованиеОтклонения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольКачества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов/Ext/ManagerModule.bsl
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка()));
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = ВРЕГ("РезультатыТестовогоОтвяза");
	КомандаПечати.Представление = "Результаты тестового отвяза";
	КомандаПечати.МенеджерПечати    = ОбъектМетаданных.ПолноеИмя();
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 10; 	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт    	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;                                                            	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РезультатыТестовогоОтвяза") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РезультатыТестовогоОтвяза", "Чек Лист", ПечатьРезультатовТестовогоОтвяза(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьРезультатовТестовогоОтвяза(МассивСсылок, ОбъектыПечати = Неопределено) Экспорт
	Ссылка= МассивСсылок.Получить(0);
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ПолеСверху = 10;
	ТабДок.ПолеСлева = 20;
	ТабДок.ПолеСнизу = 10;
	ТабДок.ПолеСправа = 10;
	ТабДок.ТолькоПросмотр = Истина;
	
	Макет = ПолучитьМакет("РезультатыТестовогоОтвяза");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицыПоОтвязам = Макет.ПолучитьОбласть("ШапкаТаблицыПоОтвязам");
	ОбластьСтрокаТаблицыПоОтвязам = Макет.ПолучитьОбласть("СтрокаТаблицыПоОтвязам");
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ОбластьШапкаТаблицыКонтрольКачества = Макет.ПолучитьОбласть("ШапкаТаблицыКонтрольКачества");
	ОбластьСтрокаТаблицыКонтрольКачества = Макет.ПолучитьОбласть("СтрокаТаблицыКонтрольКачества");
	ОбластьИзображенияДефектов = Макет.ПолучитьОбласть("ИзображенияДефектов");
	
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов = Константы.ксп_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов.Получить();
	ПустаяКартинка = Новый Картинка;
	ФИОПроверил = ФизическиеЛицаУТ.ФамилияИмяОтчество(Ссылка.Проверил.ФизическоеЛицо, Ссылка.Дата);
	ОбластьЗаголовок.Параметры.Проверил = ФИОПроверил.Фамилия + " " + ФИОПроверил.Имя + " " + ФИОПроверил.Отчество;
	ТоварыИзПоступления = Ссылка.ДокументОснование.ДокументОснование.ДокументОснование.Товары;
	ТоварыИзЧекЛистаПряжи = Ссылка.ДокументОснование.Товары;
	Для Каждого СтрокаТовары Из Ссылка.Товары Цикл
		Если СтрокаТовары.НомерСтроки <> 1 Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьШапкаТаблицыПоОтвязам);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаТаблицыПоОтвязам);
		ОбластьСтрокаТаблицыПоОтвязам.Параметры.Заполнить(Ссылка);   		
		ОбластьСтрокаТаблицыПоОтвязам.Параметры.Заполнить(СтрокаТовары);
		//СтруктураПоискаТовара = Новый Структура;
		//СтруктураПоискаТовара.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		//СтруктураПоискаТовара.Вставить("ХарактеристикаНоменклатуры", СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование);
		//СтруктураПоискаТовара.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
		//СтрокаТоварИзПоступления = ТоварыИзПоступления.НайтиСтроки(СтруктураПоискаТовара);
		//Если СтрокаТоварИзПоступления.Количество() = 0 Тогда
		//	Сообщить("В поступлении не найдена номенклатура " + СтрокаТовары.Номенклатура + " " + СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование + " с единицей измерения " + СтрокаТовары.ЕдиницаИзмерения, СтатусСообщения.Важное);
		//Иначе
		//	ОбластьСтрокаТаблицыПоОтвязам.Параметры.КоличествоВПоставке = СтрокаТоварИзПоступления[0].Количество;
		//КонецЕсли;
		СтруктураПоискаТовара = Новый Структура;
		СтруктураПоискаТовара.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтруктураПоискаТовара.Вставить("Характеристика", СтрокаТовары.Характеристика);
		СтруктураПоискаТовара.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
		СтрокаТоварИзЧекЛистаПряжи = ТоварыИзЧекЛистаПряжи.НайтиСтроки(СтруктураПоискаТовара);
		Если СтрокаТоварИзЧекЛистаПряжи.Количество() = 0 Тогда
			Сообщить("В чек листе проверки качества пряжи не найдена номенклатура " + СтрокаТовары.Номенклатура + " " + СтрокаТовары.ХарактеристикаНоменклатуры.ХарактеристикаОснование + " с единицей измерения " + СтрокаТовары.ЕдиницаИзмерения, СтатусСообщения.Важное);
		Иначе
			ОбластьСтрокаТаблицыПоОтвязам.Параметры.ДатаВизуальногоОсмотра = СтрокаТоварИзЧекЛистаПряжи[0].ВизуальныйОсмотрДатаЗавершенияПроверки;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрокаТаблицыПоОтвязам);
		ТабДок.Вывести(ОбластьРазделитель);
		ТабДок.Вывести(ОбластьШапкаТаблицыКонтрольКачества);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьСтрокаТаблицыКонтрольКачества);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки); 		
		ПунктыПроверкиКонтроляКачества = Ссылка.КонтрольКачества.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаКонтрольКачества Из ПунктыПроверкиКонтроляКачества Цикл			
			ОбластьСтрокаТаблицыКонтрольКачества.Параметры.Заполнить(СтрокаКонтрольКачества);
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДок, МассивОбластейДляПроверки) Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДок.Вывести(ОбластьШапкаТаблицыКонтрольКачества);
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаТаблицыКонтрольКачества);
		КонецЦикла;
		
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьИзображенияДефектов);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСтроки", СтрокаТовары.КлючСтроки); 
		ФотоДефектов = Ссылка.ФотоДефектов.НайтиСтроки(СтруктураОтбора);
		ИндексФото = 1;
		Для Каждого СтрокаФотоДефектов Из ФотоДефектов Цикл
			Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиТестовыхОтвязов + СтрЗаменить(СтрокаФотоДефектов.ПутьКФайлу, ".\\", "\");
			Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ИндексФото + ".Картинка = Новый Картинка(Файл)");
			Если ИндексФото < 4 Тогда
				ИндексФото = ИндексФото + 1;
			Иначе
				ИндексФото = 1;
				ТабДок.Вывести(ОбластьИзображенияДефектов);
			КонецЕсли;
		КонецЦикла;
		Если ИндексФото <= 4 Тогда
			Для ТекущийИндексФото = ИндексФото По 4 Цикл
				Выполнить("ОбластьИзображенияДефектов.Рисунки.ИзображениеДефекта" + ТекущийИндексФото + ".Картинка = Новый Картинка");
			КонецЦикла;
			ТабДок.Вывести(ОбластьИзображенияДефектов);
		КонецЕсли;
	КонецЦикла; 
		
	Возврат ТабДок;
КонецФункции
